# mailing.py
import logging

USER_DATA_FILE = r'admin/user_data.txt'

# Функция для обработки команды /newsletter
def mall_broadcast(bot, message):
    # Проверяем, является ли отправитель сообщения администратором
    if message.from_user.id == 959191746:  # Установите ID администратора
        # Текст сообщения для рассылки
        broadcast_message = "Внимание! На канале Stih Gamer вышел новый видеоролик! \n\n🎉 Погрузитесь в увлекательный мир нашего контента и получите дозу положительных эмоций. Смотрите прямо сейчас и не забудьте подписаться на канал, чтобы не пропустить новые видео! \n\nСсылка на видео: https://youtu.be/nzskmGIcK4g?si=_IoRSPqjapWIFik3"
        # Путь к изображению
        image_path = 'admin/Filemania/Gallery/thumbnail.jpeg' # Установите путь к изображению

        # Отправляем рассылку всем пользователям
        ser_broadcast(bot, message, broadcast_message, image_path)

        # Подтверждение администратору о успешном выполнении рассылки
        bot.reply_to(message, "Рассылка успешно выполнена!")
    else:
        # Если отправитель не является администратором, отправляем сообщение о недостаточных правах
        bot.reply_to(message, "У вас недостаточно прав для выполнения этой команды.")

# Функция для отправки рассылки
def ser_broadcast(bot, message, broadcast_message, image_path):
    try:
        # Читаем список чатов из файла
        with open(USER_DATA_FILE, 'r') as f:
            for line in f:
                chat_id = line.strip().split(', ')[-1].split(': ')[1]
                try:
                    # Открываем изображение и отправляем его вместе с текстом в одном сообщении
                    with open(image_path, 'rb') as photo:
                        bot.send_photo(chat_id, photo, caption=broadcast_message)
                except Exception as e:
                    logging.error(f"Ошибка отправки рассылки в чат {chat_id}: {e}")
    except Exception as e:
        logging.error(f"Ошибка чтения файла с данными о чатах: {e}")