#app_groups.py
import logging

# Функция для обработки команды /gamequest_news
def gro_gamequest_news(bot, message):
    # Текст сообщения с приглашением подписаться на канал
    news_message = "👾 Погрузитесь в мир свежих игровых новостей! Присоединяйтесь к одному из проектов Андрея Мухамеда, чтобы не пропустить ни одной захватывающей подробности простым языком: https://t.me/GameQuest_news"
    
    # Отправка сообщения
    bot.send_message(message.chat.id, news_message)
    
# Функция для обработки команды /nanson_cfm
def gro_nanson_cfm(bot, message):
    # Текст сообщения с приглашением подписаться на канал
    news_message = "🎧 Наслаждайтесь своей любимой музыкой везде и всюду! Присоединяйтесь к музыкальному проекту Андрея Мухамеда и погружайтесь в безграничный мир мелодий и ритмов: https://t.me/Nanson_CFM"
    
    # Отправка сообщения
    bot.send_message(message.chat.id, news_message)
    
# Функция для обработки команды /andremuhamedd
def gro_andremuhamedd(bot, message):
    # Текст сообщения с приглашением подписаться на канал
    news_message = "📢 Самые свежие новости о проектах Андрея Мухамеда, чтобы вы всегда были в курсе всех событий и обновлений. Подписывайтесь здесь: https://t.me/andremuhamedd"
    
    # Отправка сообщения
    bot.send_message(message.chat.id, news_message)
